{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# About\n",
    "\n",
    "This notebook and series after it will focus on interacting with a Neo4j database from Python. The downside to this, is it's hard to visualize some of the queries being ran. It's highly encourage to switch between the notebook and your local Neo4j Desktop database.\n",
    "\n",
    "To download Neo4j Desktop, follow the instructions [here.](https://neo4j.com/download/)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Cypher Keywords"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## `CREATE`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`CREATE` -> Used to create nodes in a graph.\n",
    "* **Creating Nodes**\n",
    "    * **WARNING:** Although this section is focused on using `CREATE`, it does have the ability to generate duplicate nodes. For example, `CREATE (n:Person {id: 1}) RETURN n;` will generate a new 'Person' node with property: '{id: 1}' as many times as the query is executed. However, swapping `CREATE` for `MERGE` will prevent duplicates from appearing in the graph.\n",
    "        * It is better practice to use `MERGE` over `CREATE`\n",
    "    * Create a node with single labels by using: `MERGE (n:Person) RETURN n`. Specify multiple labels like `MERGE (n:Person:Animal:Professional) RETURN n`\n",
    "    * Create a node with properties inside curly brackets like so: `MERGE (n:Person {name: \"Henry\", age: 17}) RETURN n`\n",
    "\n",
    "* **Creating Relationships**\n",
    "    * This is best illustrated through an example. Let's say Sally goes to the store to buy some pickles. To represent this graphically, first create two nodes for entities Sally (person) and pickles (food). The action or relationship between the two is the act of purchasing. So, in cypher we would write:\n",
    "        > `CREATE (p:Person {name: \"Sally\"}), (f:Food {item: \"Pickles\"}), (p)-[:PURCHASES]->(f) RETURN p, f;`\n",
    "\n",
    "        > `MERGE (p:Person {name: \"Sally\"})`<br>\n",
    "          `MERGE (f:Food {item: \"Pickles\"})`<br>\n",
    "          `MERGE (p)-[:PURCHASES]->(f)`<br>\n",
    "          `RETURN p, f;`<br>\n",
    "\n",
    "`RETURN` -> Instructed the graph to send back data from the graph based on what follows the 'RETURN' keyword.\n",
    "* `RETURN *` will return all variables and properties from the query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, Record, ResultSummary, EagerResult\n",
    "from neo4j.graph import Node, Relationship, Path\n",
    "from neo4j.time import Date\n",
    "\n",
    "import pandas as pd\n",
    "pd.set_option('display.max_colwidth', 100)\n",
    "\n",
    "import os \n",
    "import socket\n",
    "from dotenv import load_dotenv \n",
    "load_dotenv()\n",
    "\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "When working from WSL2 and Neo4j Desktop is installed on the Windows side, you have to set up port forwarding. To do this, open a Powershell administrator window and run the following:\n",
    "1. Run `ipconig`\n",
    "* From this point forward assume you have a Windows ip address of: '123.456.78.900'\n",
    "2. Launch the Neo4j database you want to query and take note of the port number (at the time of righting this, the default bolt port is '7687').\n",
    "3. Run `netsh interface portproxy set v4tov4 listenport=7687 listenaddress=123.456.78.900 connectport=7687 connectaddress=127.0.0.1`\n",
    "4. To verify, run `netsh interface portproxy show v4tov4`\n",
    "5. To disable the port forwarding, run `netsh interface portproxy delete v4tov4 listenport=1234 listenaddress=123.456.78.900`\n",
    "\n",
    "If working from a windows environment where Neo4j Desktop is installed, the default 'localhost' URI should be sufficient."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def process_node(node: Node) -> dict:\n",
    "    \"\"\" \n",
    "    Parses the result from the query into a more consumable dictionary\n",
    "\n",
    "    Args:\n",
    "        A neo4j.graph.Node object \n",
    "    \n",
    "    Returns:\n",
    "        A dictionary with the following defintions for each key:\n",
    "            * \"elementId\" -> A unique identifier of each object returned from the graph for any given transaction.\n",
    "              IMPORTANT!! Not that each 'elementId' may not be the same across transactions. Meaning each time the \n",
    "              graph is queried, it's possible that a new 'elementId' is generated for the same object.\n",
    "            * \"labels\" -> The label(s) of the node as it appears in the graph.\n",
    "            * \"properties\" -> The properties of the node as represented in the graph.\n",
    "    \"\"\"\n",
    "    if isinstance(node, Node):\n",
    "        return {\n",
    "            \"elementId\": node.element_id,\n",
    "            \"labels\": node.labels,\n",
    "            \"properties\": dict(node.items())\n",
    "        }\n",
    "    else:\n",
    "        raise ValueError(f\"Input value `node` is not of type neo4j.graph.Relationship. Type {type(node)} passed.\")\n",
    "\n",
    "\n",
    "def process_relationship(relationship: Relationship) -> dict:\n",
    "    \"\"\" \n",
    "    Parses the result from the query into a more consumable dictionary.\n",
    "\n",
    "    Args:\n",
    "        A neo4j.graph.Relationship object \n",
    "    \n",
    "    Returns:\n",
    "        A dictionary with the following defintions for each key:\n",
    "            * \"startNode\" -> In a \"source/target\" diagram, the start node is the source of the relationship. The \n",
    "              relationship comes from the 'startNode'.\n",
    "                - \"elementId\" -> A unique identifier of each object returned from the graph for any given transaction.\n",
    "                  IMPORTANT!! Not that each 'elementId' may not be the same across transactions. Meaning each time the \n",
    "                  graph is queried, it's possible that a new 'elementId' is generated for the same object.\n",
    "                - \"labels\" -> The label(s) of the node as it appears in the graph.\n",
    "                - \"properties\" -> The properties of the node as represented in the graph.\n",
    "            * \"elementId\" -> The UID for the relationship. Please see \"startNode\" -> \"elementId\".\n",
    "            * \"type\" -> The \"label\" of the relationship, or its name.\n",
    "            * \"properties\" -> The properties of the relationship as represented in the graph.\n",
    "            * \"endNode\" - > In a \"source/target\" diagram, the end node is the target of the relationship. The \n",
    "            relationship points towards the 'endNode'.\n",
    "                - \"elementId\" -> The UID for the \"endNode\". Please see \"startNode\" -> \"elementId\".\n",
    "                - \"labels\" -> The label(s) of the node as it appears in the graph.\n",
    "                - \"properties\" -> The properties of the node as represented in the graph.\n",
    "    \"\"\"\n",
    "    if isinstance(relationship, Relationship):\n",
    "        return {\n",
    "            \"startNode\": {\n",
    "                \"elementId\": relationship.nodes[0].element_id,\n",
    "                \"labels\": relationship.nodes[0].labels,\n",
    "                \"properties\": dict(relationship.nodes[0].items())\n",
    "                },\n",
    "            \"elementId\": relationship.element_id,\n",
    "            'type': relationship.type,\n",
    "            'properties': dict(relationship.items()),\n",
    "            \"endNode\": {\n",
    "                \"elementId\": relationship.nodes[1].element_id,\n",
    "                \"labels\": relationship.nodes[1].labels,\n",
    "                \"properties\": dict(relationship.nodes[1].items())\n",
    "            }\n",
    "        }\n",
    "    else:\n",
    "        raise ValueError(f\"Input value `relationship` is not of type neo4j.graph.Relationship. Type {type(relationship)} passed.\")\n",
    "    \n",
    "\n",
    "def process_path(path: Path) -> dict:\n",
    "    \"\"\" \n",
    "    Parses the result from the query into a more consumable dictionary.\n",
    "\n",
    "    Args:\n",
    "        A neo4j.graph.Path object \n",
    "    \n",
    "    Returns:\n",
    "        A dictionary with the following defintions for each key:\n",
    "            * \"startNodeElementId\" -> A unique identifier of each object returned from the graph for any given transaction.\n",
    "              IMPORTANT!! Not that each 'elementId' may not be the same across transactions. Meaning each time the \n",
    "              graph is queried, it's possible that a new 'elementId' is generated for the same object.\n",
    "            * \"nodes\" -> A list of processed nodes, please see doc string for `process_node` function. The length of the list\n",
    "              will depend on the number of nodes specified in the path expression.\n",
    "            * \"relationships\" -> A list of processed relationships, please see doc string for `process_relationship` function.\n",
    "              The length of the list will depend on the number of relationships specific in the path expression.\n",
    "            * \"endNodeElementId\" -> A UID for the \"end node\". Please see \"startNodeElementId\".\n",
    "    \"\"\"\n",
    "    if isinstance(path, Path):\n",
    "        return {\n",
    "            \"startNodeElementId\": path.start_node.element_id,\n",
    "            \"nodes\": [process_node(node) for node in path.nodes],\n",
    "            \"relationships\": [process_relationship(relationship) for relationship in path.relationships],\n",
    "            \"endNodeElementId\": path.end_node.element_id\n",
    "        }\n",
    "    else:\n",
    "        raise ValueError(f\"Input value `path` is not of type neo4j.graph.Path. Type {type(path)} passed.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def annotate_results(result: EagerResult, verbose: bool = False, return_table: bool = True) -> dict | pd.DataFrame:\n",
    "    \"\"\" \n",
    "    A helper function to optionally print out some helpful metadata around the query and return\n",
    "    a dictionary similar to what you would see in Neo4j Browser 'Table' view.\n",
    "\n",
    "    Args:\n",
    "        result -> The EagerResult object returned by Neo4j\n",
    "        verbose -> Optional parameter to print out informative query metadata or not\n",
    "\n",
    "    Returns:\n",
    "        A list of records as dictionaries\n",
    "    \"\"\"\n",
    "    start = result.summary.result_available_after\n",
    "    finish = start + result.summary.result_consumed_after\n",
    "    print(f\"Started streaming {len(result.records)} records after {start} ms and completed after {finish} ms.\\n\")\n",
    "    \n",
    "    if verbose:\n",
    "        print(f\"Query executed against database: '{result.summary.database}': {result.summary.query}\")\n",
    "\n",
    "    # Parse the initial EagerResult\n",
    "    data: list[list[list[tuple[str, Path | Relationship | Node]]]] = [record.items() for record in result.records]\n",
    "    # Determine the column headers required based on the number of variables returned in the query.\n",
    "    column_headers = list(set([variable[0] for record in data for variable in record]))\n",
    "    # The final processed dictionary to be returned at the end\n",
    "    processed_records: dict[str, list[dict]] = {key: [] for key in column_headers}\n",
    "\n",
    "    # 'data' holds EagerResult parsed data represented as a list for each record returned by the query\n",
    "    for i in range(len(data)):\n",
    "        # 'var_returned' holds a single record of lists where each list is a data point for each variable returned\n",
    "        for var_returned in data[i]:\n",
    "            # 'data_object' iterates through the variable name (column value) at index 0, and beyond that and individual data point returned by the query\n",
    "            for index, data_object in enumerate(var_returned):\n",
    "                # The first index will hold the variable name that will help us determine how to store this data tabularly\n",
    "                if index == 0:\n",
    "                    column_header = str(data_object)\n",
    "                    continue\n",
    "                \n",
    "                # After index 0, each 'data_object' will contain actual data returned from the graph\n",
    "                if isinstance(data_object, list):\n",
    "                    # Paths like to return neo4j.graph objects in lists, while non paths do not. So, we need to handle this\n",
    "                    data_object = data_object[0]\n",
    "\n",
    "                if isinstance(data_object, Node):\n",
    "                    processed_records[column_header].append(process_node(data_object))\n",
    "                elif isinstance(data_object, Relationship):\n",
    "                    processed_records[column_header].append(process_relationship(data_object))\n",
    "                elif isinstance(data_object, Path):\n",
    "                    processed_records[column_header].append(process_path(data_object))\n",
    "                else:\n",
    "                    processed_records[column_header].append(data_object)\n",
    "                    # raise ValueError(f\"Unexpected datatype encountered. Of type: {type(data_object)}\")\n",
    "                \n",
    "    if return_table:\n",
    "        return pd.DataFrame(processed_records)\n",
    "    else:\n",
    "        return processed_records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7f6dcd0e46b0>, keys=[])"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# We are going to create a dev database so that we can do whatever we want in it\n",
    "driver.execute_query(\"CREATE DATABASE dev IF NOT EXISTS;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What the heck is an ['EagerResult'](https://neo4j.com/docs/api/python-driver/current/api.html#neo4j.EagerResult)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Let's create 5 nodes \n",
    "for _ in range(5):\n",
    "    result: EagerResult[list[Record], ResultSummary, list[str]] = driver.execute_query(\n",
    "        \"\"\" \n",
    "        CREATE (n) RETURN n;\n",
    "        \"\"\",\n",
    "        database_=\"dev\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "To keep things clean, I'll only annotate the 'result' variable once. Clearly the response returned from Neo4j is a pretty complex object that holds a ton of useful information. I would encourage you to explore their documentation and modify the `annotate_results` function to provide you with information that is the most helpful to you!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 51 records after 0 ms and completed after 0 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    MATCH (n) RETURN n;\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:1', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:3', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:5', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:8', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:9', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:10', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:11', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:12', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:13', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:14', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:15', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:16', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:17', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:18', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:19', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:20', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:21', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:22', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:23', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:24', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:25', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:26', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:27', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:28', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:29', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:30', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:31', 'labels': ('Food'), 'properties': {'i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:32', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:33', 'labels': ('Food'), 'properties': {'i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:34', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:35', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:36', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:37', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:38', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:39', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:40', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:41', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:42', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:43', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:44', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:45', 'labels': ('Person'), 'properties': {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:46', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:47', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:48', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:49', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:50', 'labels': (), 'properties': {}}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                      n\n",
       "0             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': (), 'properties': {}}\n",
       "1             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:1', 'labels': (), 'properties': {}}\n",
       "2             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': (), 'properties': {}}\n",
       "3             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:3', 'labels': (), 'properties': {}}\n",
       "4             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': (), 'properties': {}}\n",
       "5             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:5', 'labels': (), 'properties': {}}\n",
       "6             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': (), 'properties': {}}\n",
       "7             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': (), 'properties': {}}\n",
       "8             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:8', 'labels': (), 'properties': {}}\n",
       "9             {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:9', 'labels': (), 'properties': {}}\n",
       "10           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:10', 'labels': (), 'properties': {}}\n",
       "11           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:11', 'labels': (), 'properties': {}}\n",
       "12           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:12', 'labels': (), 'properties': {}}\n",
       "13           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:13', 'labels': (), 'properties': {}}\n",
       "14           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:14', 'labels': (), 'properties': {}}\n",
       "15           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:15', 'labels': (), 'properties': {}}\n",
       "16           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:16', 'labels': (), 'properties': {}}\n",
       "17           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:17', 'labels': (), 'properties': {}}\n",
       "18           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:18', 'labels': (), 'properties': {}}\n",
       "19           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:19', 'labels': (), 'properties': {}}\n",
       "20           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:20', 'labels': (), 'properties': {}}\n",
       "21           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:21', 'labels': (), 'properties': {}}\n",
       "22           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:22', 'labels': (), 'properties': {}}\n",
       "23           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:23', 'labels': (), 'properties': {}}\n",
       "24           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:24', 'labels': (), 'properties': {}}\n",
       "25           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:25', 'labels': (), 'properties': {}}\n",
       "26           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:26', 'labels': (), 'properties': {}}\n",
       "27           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:27', 'labels': (), 'properties': {}}\n",
       "28           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:28', 'labels': (), 'properties': {}}\n",
       "29           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:29', 'labels': (), 'properties': {}}\n",
       "30  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:30', 'labels': ('Person'), 'properties': {...\n",
       "31  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:31', 'labels': ('Food'), 'properties': {'i...\n",
       "32  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:32', 'labels': ('Person'), 'properties': {...\n",
       "33  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:33', 'labels': ('Food'), 'properties': {'i...\n",
       "34  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:34', 'labels': ('Person'), 'properties': {...\n",
       "35  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:35', 'labels': ('Person'), 'properties': {...\n",
       "36  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:36', 'labels': ('Person'), 'properties': {...\n",
       "37  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:37', 'labels': ('Person'), 'properties': {...\n",
       "38  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:38', 'labels': ('Person'), 'properties': {...\n",
       "39  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:39', 'labels': ('Person'), 'properties': {...\n",
       "40  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:40', 'labels': ('Person'), 'properties': {...\n",
       "41  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:41', 'labels': ('Person'), 'properties': {...\n",
       "42  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:42', 'labels': ('Person'), 'properties': {...\n",
       "43  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:43', 'labels': ('Person'), 'properties': {...\n",
       "44  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:44', 'labels': ('Person'), 'properties': {...\n",
       "45  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:45', 'labels': ('Person'), 'properties': {...\n",
       "46           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:46', 'labels': (), 'properties': {}}\n",
       "47           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:47', 'labels': (), 'properties': {}}\n",
       "48           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:48', 'labels': (), 'properties': {}}\n",
       "49           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:49', 'labels': (), 'properties': {}}\n",
       "50           {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:50', 'labels': (), 'properties': {}}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's see how many nodes are in our graph\n",
    "result: EagerResult[list[Record], ResultSummary, list[str]] = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (n) RETURN n;\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "Notice how `CREATE` made 5 copies of the same node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 1 ms and completed after 1 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    CREATE (p:Person {name: \"Sally\"})\n",
      "    RETURN p\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:54',\n",
       " 'labels': frozenset({'Person'}),\n",
       " 'properties': {'name': 'Sally'}}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's create a person in our graph named Sally\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    CREATE (p:Person {name: \"Sally\"})\n",
    "    RETURN p\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)\n",
    "\n",
    "# Let's take a look at how our record is represented in python\n",
    "df.at[0, 'p']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 0 records after 24 ms and completed after 24 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    MATCH (n) DETACH DELETE n;\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Let's delete all records in Neo4j\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (n) DETACH DELETE n;\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 0 ms and completed after 0 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    CREATE (p:Person {name: \"Sally\"}), (f:Food {item: \"Pickles\"}), (p)-[r:PURCHASES]->(f) RETURN *;\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'f': [{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:3',\n",
       "   'labels': frozenset({'Food'}),\n",
       "   'properties': {'item': 'Pickles'}}],\n",
       " 'r': [{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'name': 'Sally'}},\n",
       "   'elementId': '5:ff73e06d-56ad-4959-b409-fcc3d9dce978:1152921504606846978',\n",
       "   'type': 'PURCHASES',\n",
       "   'properties': {},\n",
       "   'endNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:3',\n",
       "    'labels': frozenset({'Food'}),\n",
       "    'properties': {'item': 'Pickles'}}}],\n",
       " 'p': [{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'name': 'Sally'}}]}"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's create a relationship with one direction to represent the scenario \"Sally goes to the store and purchases pickles\"\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    CREATE (p:Person {name: \"Sally\"}), (f:Food {item: \"Pickles\"}), (p)-[r:PURCHASES]->(f) RETURN *;\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True, False)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 1 ms and completed after 2 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    CREATE (p:Person {name: \"Sally\"}), (f:Food {item: \"Pickles\"}), (p)-[r:PURCHASES {purchased_on: $purchase_date}]->(f) RETURN *;\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Add a date property to our relationship for event or transactional data\n",
    "purchase_date = Date(year=2025, month=1, day=31)\n",
    "\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    CREATE (p:Person {name: \"Sally\"}), (f:Food {item: \"Pickles\"}), (p)-[r:PURCHASES {purchased_on: $purchase_date}]->(f) RETURN *;\n",
    "    \"\"\",\n",
    "    database_=\"dev\",\n",
    "    purchase_date=purchase_date\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "Notice the additional argument in the `driver.execute_query` function. Neo4j lets you parametize queries for a number of reasons. In this case, we are defining a variable using a Neo4j datatype so we know it will insert into the graph the way we expect. Parametize queries by prefixing the variable with \"$\". Check out the datatypes for the Neo4j python driver [here](https://neo4j.com/docs/python-manual/current/data-types/)!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 6 records after 0 ms and completed after 2 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    MATCH (p:Person {name: \"Sally\"}), (f:Person {name: \"Sarah\"})\n",
      "    WITH p, f\n",
      "    CREATE (p)-[r:HAS_FRIEND]->(f)-[rr:HAS_FRIEND]->(p)\n",
      "    RETURN *;\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>f</th>\n",
       "      <th>r</th>\n",
       "      <th>rr</th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...</td>\n",
       "      <td>{'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'properties': {'...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                     f  \\\n",
       "0  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...   \n",
       "1  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...   \n",
       "2  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...   \n",
       "3  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...   \n",
       "4  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'properties': {'...   \n",
       "5  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'properties': {'...   \n",
       "\n",
       "                                                                                                     r  \\\n",
       "0  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'p...   \n",
       "1  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'p...   \n",
       "2  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'p...   \n",
       "3  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'p...   \n",
       "4  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'p...   \n",
       "5  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'p...   \n",
       "\n",
       "                                                                                                    rr  \\\n",
       "0  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...   \n",
       "1  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...   \n",
       "2  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...   \n",
       "3  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...   \n",
       "4  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:6', 'labels': ('Person'), 'p...   \n",
       "5  {'startNode': {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:7', 'labels': ('Person'), 'p...   \n",
       "\n",
       "                                                                                                     p  \n",
       "0  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'properties': {'...  \n",
       "1  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:0', 'labels': ('Person'), 'properties': {'...  \n",
       "2  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'properties': {'...  \n",
       "3  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:2', 'labels': ('Person'), 'properties': {'...  \n",
       "4  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'properties': {'...  \n",
       "5  {'elementId': '4:ff73e06d-56ad-4959-b409-fcc3d9dce978:4', 'labels': ('Person'), 'properties': {'...  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's create a bi-directional relationship. Let's say Sally has a friend, Sarah\n",
    "driver.execute_query(\n",
    "    \"\"\" \n",
    "    CREATE (p:Person {name: \"Sarah\"});\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (p:Person {name: \"Sally\"}), (f:Person {name: \"Sarah\"})\n",
    "    WITH p, f\n",
    "    CREATE (p)-[r:HAS_FRIEND]->(f)-[rr:HAS_FRIEND]->(p)\n",
    "    RETURN *;\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True, True)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "You can also use pathes to create a complex pattern."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 1 ms and completed after 3 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    CREATE p=(mike:Person {name:\"Mike\"})-[:FOLLOWS]->(jackie:Person {name:\"Jackie\"})<-[:FOLLOWS]-(tim:Person {name:\"Tim\"})\n",
      "    RETURN p;\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Use a path to create a pattern where Mike follows Jackie who is followed by Tim\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    CREATE p=(mike:Person {name:\"Mike\"})-[:FOLLOWS]->(jackie:Person {name:\"Jackie\"})<-[:FOLLOWS]-(tim:Person {name:\"Tim\"})\n",
    "    RETURN p;\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTE:**\n",
    "\n",
    "Cypher keywords *ARE NOT* case sensitive. Let's try it below."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 32 ms and completed after 33 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    create \n",
      "    (D:Person{name:'Dan'}),\n",
      "    (K:Person{name:'Kate'}),\n",
      "    (M:Person{name:'Mike'}),\n",
      "    (L:Person{name:'Luke'}),\n",
      "    (S:Person{name:'Steve'}),\n",
      "    (F:Person{name:'Favour'}),\n",
      "    (faith:Person{name:'Faith'}),\n",
      "    (J:Person{name:'Jane'}),\n",
      "    (D)-[:MARRIED_TO]->(K)-[:MARRIED]->(D),\n",
      "    (D)-[:PARENT_OF]->(M)<-[:PARENT_OF]-(K),\n",
      "    (D)-[:PARENT_OF]->(L)<-[:PARENT_OF]-(K),\n",
      "    (D)-[:PARENT_OF]->(S)<-[:PARENT_OF]-(K),\n",
      "    (F)-[:MARRIED_TO]->(S)-[:MARRIED]->(F),\n",
      "    (F)-[:PARENT_OF]->(faith)<-[:PARENT_OF]-(S),\n",
      "    (F)-[:PARENT_OF]->(J)<-[:PARENT_OF]-(S)\n",
      "    return *\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Create a long series of node and relationships for a family tree\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    create \n",
    "    (D:Person{name:'Dan'}),\n",
    "    (K:Person{name:'Kate'}),\n",
    "    (M:Person{name:'Mike'}),\n",
    "    (L:Person{name:'Luke'}),\n",
    "    (S:Person{name:'Steve'}),\n",
    "    (F:Person{name:'Favour'}),\n",
    "    (faith:Person{name:'Faith'}),\n",
    "    (J:Person{name:'Jane'}),\n",
    "    (D)-[:MARRIED_TO]->(K)-[:MARRIED]->(D),\n",
    "    (D)-[:PARENT_OF]->(M)<-[:PARENT_OF]-(K),\n",
    "    (D)-[:PARENT_OF]->(L)<-[:PARENT_OF]-(K),\n",
    "    (D)-[:PARENT_OF]->(S)<-[:PARENT_OF]-(K),\n",
    "    (F)-[:MARRIED_TO]->(S)-[:MARRIED]->(F),\n",
    "    (F)-[:PARENT_OF]->(faith)<-[:PARENT_OF]-(S),\n",
    "    (F)-[:PARENT_OF]->(J)<-[:PARENT_OF]-(S)\n",
    "    return *\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## `MATCH`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* `MATCH` -> Used like SQL's `SELECT` statement. It is a read only command to extract data from the graph.\n",
    "    * To return everything from the graph we can run `MATCH (n) RETURN n;`\n",
    "* To return related nodes, we call a node's label. We can write `MATCH (n:Person) RETURN n;` to return ALL 'Person' nodes.\n",
    "    * To return related nodes with more than one label: `MATCH (n:Person:Doctors) RETURN n;` to return ALL 'Person' and 'Doctor' nodes.\n",
    "* We can match nodes via a pattern by not specifying a direction in the relationship, for example: `MATCH (n:Person)--(d:Doctor) RETURN *` tells the query to return all instances of person and doctor regardless of the direction of the relationship.\n",
    "* You can use backticks '\\`' to introduce uncommon characters in your queries. For example `MATCH (``THIS IS MY NODE VARIABLE``) RETRUN ``THIS IS MY NODE VARIABLE``;`\n",
    "* You can use `MATCH` to select a node and use it's properties as properties for a new node, for example:<br>\n",
    "\n",
    "    `MATCH (n:Person {name:\"Tom Hanks\"})`<br>\n",
    "    `CREATE (n:Person {name:n.name})`<br>\n",
    "    `RETURN *`\n",
    "* We can do the same for relationships, for example:<br>\n",
    "\n",
    "    `MATCH (n:Person {name:\"Sally\"})-[r:PURCHASED]->(f:Food {item:\"Pickles})`<br>\n",
    "    `CREATE (n:Person {name:\"Sally\", purchased_pickles_on: r.purchased_on})`<br>\n",
    "    `RETURN *`\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## `RETURN`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* At this point are familiar with the basics of `RETURN`, but here we will look at it a little bit deeper.\n",
    "* `RETURN` is equivalent to SQL's `SELECT`, much like the `MATCH` keyword we learned about previously.\n",
    "* `RETURN` allows us to return all, or we can return specific properties, aggregations, filtered data, etc. just like `SELECT` in SQL.\n",
    "* If I have a query: `MATCH (n:Person) RETURN n;` this will return the nodes and we will see a picture of all the nodes. If we want to return the data in tabular format. We can return the specific properties or use a function `properties` to return all properties of my nodes: `MATCH (n) RETURN properties(n) as prop;`. This will not include the label of the nodes. To add that you can do: `MATCH (n) RETURN properties(n) as prop, labels(n) as n_label;`\n",
    "* For returned relationship data, we have a few options that include but are not limited to, assuming we have the query `MATCH (n)-[r]-(m)`: `type(r)` -> returns the name or label of the relationship, `r` returns all data about 'r', or `r.<property_name>` to return specific properties.\n",
    "* You can use `DISTINCT` keyword after `RETURN` the same way you would use it in SQL, to return non-duplicated information.\n",
    "* You can use `RETURN reltionships(n)` to return all relationships in your query. This is helpful in a complicated path variable."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 3 records after 0 ms and completed after 1 ms.\n",
      "\n",
      "Query executed against database: 'dev':  \n",
      "    MATCH (p:Person)-[r:PURCHASES]->(f:Food)\n",
      "    RETURN {\n",
      "        source: {properties: properties(p), labels: labels(p)}, \n",
      "        relationship: {properties: properties(r), type: type(r)}, \n",
      "        target: {properties: properties(f), labels: labels(f)}\n",
      "    } AS record\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'record': [{'relationship': {'properties': {}, 'type': 'PURCHASES'},\n",
       "   'source': {'labels': ['Person'], 'properties': {'name': 'Sally'}},\n",
       "   'target': {'labels': ['Food'], 'properties': {'item': 'Pickles'}}},\n",
       "  {'relationship': {'properties': {}, 'type': 'PURCHASES'},\n",
       "   'source': {'labels': ['Person'], 'properties': {'name': 'Sally'}},\n",
       "   'target': {'labels': ['Food'], 'properties': {'item': 'Pickles'}}},\n",
       "  {'relationship': {'properties': {'purchased_on': neo4j.time.Date(2025, 1, 31)},\n",
       "    'type': 'PURCHASES'},\n",
       "   'source': {'labels': ['Person'], 'properties': {'name': 'Sally'}},\n",
       "   'target': {'labels': ['Food'], 'properties': {'item': 'Pickles'}}}]}"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's query our graph and process the results to extract the labels, properties, and relationship types\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (p:Person)-[r:PURCHASES]->(f:Food)\n",
    "    RETURN {\n",
    "        source: {properties: properties(p), labels: labels(p)}, \n",
    "        relationship: {properties: properties(r), type: type(r)}, \n",
    "        target: {properties: properties(f), labels: labels(f)}\n",
    "    } AS record\n",
    "    \"\"\",\n",
    "    database_=\"dev\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True, False)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 59 records after 1 ms and completed after 6 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH x = (p:Person {name:\"Tom Hanks\"})--()--()\n",
      "    RETURN x\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>x</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                      x\n",
       "0   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "1   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "2   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "3   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "4   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "5   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "6   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "7   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "8   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "9   {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "10  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "11  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "12  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "13  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "14  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "15  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "16  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "17  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "18  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "19  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "20  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "21  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "22  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "23  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "24  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "25  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "26  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "27  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "28  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "29  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "30  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "31  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "32  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "33  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "34  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "35  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "36  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "37  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "38  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "39  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "40  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "41  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "42  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "43  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "44  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "45  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "46  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "47  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "48  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "49  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "50  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "51  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "52  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "53  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "54  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "55  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "56  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "57  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5...\n",
       "58  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71', 'nodes': [{'elementId': '4:5..."
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Let's return all relationships in a very open ended path match pattern\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH x = (p:Person {name:\"Tom Hanks\"})--()--()\n",
    "    RETURN x\n",
    "    \"\"\",\n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "df = annotate_results(result, True, True)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "udemy_neo4j_course",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
