{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# About\n",
    "\n",
    "This notebook will focus on pattern matching in Cypher QL."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, Record, ResultSummary, EagerResult\n",
    "from neo4j.time import Date\n",
    "\n",
    "import pandas as pd\n",
    "pd.set_option('display.max_colwidth', 100)\n",
    "\n",
    "import os \n",
    "import sys\n",
    "from dotenv import load_dotenv \n",
    "load_dotenv()\n",
    "\n",
    "# Add the utils directory to sys.path\n",
    "sys.path.append(os.path.abspath(\"../utils\"))\n",
    "\n",
    "from Neo4jParser import Neo4jParser\n",
    "\n",
    "\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTES:**\n",
    "\n",
    "* *Patterns:*\n",
    "    * `(a)-->(b)` returns all nodes in the graph that have a relationship. These are called \"related nodes\".\n",
    "    * `(a)-->(c)<--(b)` nodes that have more than one relationship in Neo4j are called \"paths\".\n",
    "    * `(a)--(b)` if you don't want to show directions, you don't have to. However, this typically produces a lot of extra results. Say you have a node A that matches to Node B like this: `(A)-->(b)`. With the pattern `(a)--(b)`, without specifiying a relationship, this will return A and B twice, which is usually not desired, but technically what the query author is asking for.\n",
    "    * `(a)-[r]->(b)` the only way to assess the relationship of a path, is by declaring a variable. In this case 'r'.\n",
    "    * `(a)-[r:RelType]->(b)` returns all records of a specific relationship type.\n",
    "    * `(a)-[r:FOLLOWS|BUYS]->(b)` returns all records of relationships that are either 'FOLLOWS' or 'BUYS'\n",
    "    * `(a)-[*]->(b)` returns all possible paths. Extremly complex query. Not necessarily advised to run without some filtered parameters.\n",
    "    * `(a)-[*3]->(b)` returs all paths that are three relationships deep.\n",
    "    * `(a)-[*1..2]->(b)` returns all paths that are 1 and 2 relationships deep.\n",
    "    * `(a)-[*0..4]->(b)` returns all paths that are 0 and 4 relationships deep. Works like an optional relatioship or `OPTIONAL MATCH`.\n",
    "        * You can specify optional relationships with: `MATCH (p:Person {name:\"Tom Hanks\"})-[*0..1]->(m:Movie) RETURN *`\n",
    "            * This query says show Tom Hanks for all relationships with 0 to 1 times with Movies. The '0' part is the node referring to itself. Like of it like `OPTIONAL MATCH`.\n",
    "    * `(a)-[*..2]->(b)` returns maximum of 2 relationships deep.\n",
    "    * `(a)-[*2..]->(b)` returns minimum of 2 relationships deep.\n",
    "\n",
    "* All patterns using an asterik can contain any relationship type in front of it to filter the relationship type allowed.\n",
    "* `allShortestPaths` function takes a pattern as input and returns the shortest path(s) between them. Can be a very powerful function."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 7 records after 0 ms and completed after 0 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH ()-[r]-()\n",
      "    RETURN DISTINCT type(r) as relationships\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'relationships': ['ACTED_IN',\n",
       "  'FRIENDS_WITH',\n",
       "  'DIRECTED',\n",
       "  'PRODUCED',\n",
       "  'WROTE',\n",
       "  'FOLLOWS',\n",
       "  'REVIEWED']}"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return all relationships in the database\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH ()-[r]-()\n",
    "    RETURN DISTINCT type(r) as relationships\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 863 records after 0 ms and completed after 27 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH (n)-[r]-(m)\n",
      "    RETURN *\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'r': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "   'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846977',\n",
       "   'type': 'ACTED_IN',\n",
       "   'properties': {'roles': ['Neo']},\n",
       "   'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "    'labels': frozenset({'Movie'}),\n",
       "    'properties': {'tagline': 'Welcome to the Real World',\n",
       "     'title': 'The Matrix',\n",
       "     'released': 1999}}},\n",
       "  {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "   'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846977',\n",
       "   'type': 'ACTED_IN',\n",
       "   'properties': {'roles': ['Neo']},\n",
       "   'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "    'labels': frozenset({'Movie'}),\n",
       "    'properties': {'tagline': 'Welcome to the Real World',\n",
       "     'title': 'The Matrix',\n",
       "     'released': 1999}}},\n",
       "  {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "   'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1155173304420532225',\n",
       "   'type': 'ACTED_IN',\n",
       "   'properties': {'roles': ['Neo']},\n",
       "   'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "    'labels': frozenset({'Movie'}),\n",
       "    'properties': {'tagline': 'Free your mind',\n",
       "     'title': 'The Matrix Reloaded',\n",
       "     'released': 2003}}},\n",
       "  {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "   'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1155173304420532225',\n",
       "   'type': 'ACTED_IN',\n",
       "   'properties': {'roles': ['Neo']},\n",
       "   'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "    'labels': frozenset({'Movie'}),\n",
       "    'properties': {'tagline': 'Free your mind',\n",
       "     'title': 'The Matrix Reloaded',\n",
       "     'released': 2003}}},\n",
       "  {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "    'labels': frozenset({'Person'}),\n",
       "    'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "   'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157425104234217473',\n",
       "   'type': 'ACTED_IN',\n",
       "   'properties': {'roles': ['Neo']},\n",
       "   'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "    'labels': frozenset({'Movie'}),\n",
       "    'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "     'title': 'The Matrix Revolutions',\n",
       "     'released': 2003}}}],\n",
       " 'm': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Free your mind',\n",
       "    'title': 'The Matrix Reloaded',\n",
       "    'released': 2003}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "    'title': 'The Matrix Revolutions',\n",
       "    'released': 2003}}],\n",
       " 'n': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Free your mind',\n",
       "    'title': 'The Matrix Reloaded',\n",
       "    'released': 2003}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}}]}"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return ALL data from my graph\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (n)-[r]-(m)\n",
    "    RETURN *\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 180 records after 2 ms and completed after 21 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH (n:Person)-[r:ACTED_IN*1..2]-(m:Movie)\n",
      "    RETURN *\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'r': [[<Relationship element_id='5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846977' nodes=(<Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1' labels=frozenset({'Person'}) properties={'born': 1964, 'name': 'Keanu Reeves'}>, <Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0' labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>) type='ACTED_IN' properties={'roles': ['Neo']}>],\n",
       "  [<Relationship element_id='5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846978' nodes=(<Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:2' labels=frozenset({'Person'}) properties={'born': 1967, 'name': 'Carrie-Anne Moss'}>, <Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0' labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>) type='ACTED_IN' properties={'roles': ['Trinity']}>],\n",
       "  [<Relationship element_id='5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846979' nodes=(<Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:3' labels=frozenset({'Person'}) properties={'born': 1961, 'name': 'Laurence Fishburne'}>, <Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0' labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>) type='ACTED_IN' properties={'roles': ['Morpheus']}>],\n",
       "  [<Relationship element_id='5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846980' nodes=(<Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:4' labels=frozenset({'Person'}) properties={'born': 1960, 'name': 'Hugo Weaving'}>, <Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0' labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>) type='ACTED_IN' properties={'roles': ['Agent Smith']}>],\n",
       "  [<Relationship element_id='5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846984' nodes=(<Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:8' labels=frozenset({'Person'}) properties={'born': 1978, 'name': 'Emil Eifrem'}>, <Node element_id='4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0' labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>) type='ACTED_IN' properties={'roles': ['Emil']}>]],\n",
       " 'm': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Welcome to the Real World',\n",
       "    'title': 'The Matrix',\n",
       "    'released': 1999}}],\n",
       " 'n': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:2',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1967, 'name': 'Carrie-Anne Moss'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:3',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1961, 'name': 'Laurence Fishburne'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:4',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1960, 'name': 'Hugo Weaving'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:8',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1978, 'name': 'Emil Eifrem'}}]}"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# you can return nested relationships in Neo4j by specifing \"*x..y\" where the number of relationships is at a minimum \"x\" and maximum \"y\"\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (n:Person)-[r:ACTED_IN*1..2]-(m:Movie)\n",
    "    RETURN *\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 1 records after 1 ms and completed after 1 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH x = (n:Person)-[*2]-(m:Movie)\n",
      "    RETURN x LIMIT 1\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'x': [{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Welcome to the Real World',\n",
       "      'title': 'The Matrix',\n",
       "      'released': 1999}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:6917536724222476293',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846977',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Neo']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Welcome to the Real World',\n",
       "       'title': 'The Matrix',\n",
       "       'released': 1999}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0'}]}"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# you can return all relationships with two nodes, two layers deep\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH x = (n:Person)-[*2]-(m:Movie)\n",
    "    RETURN x LIMIT 1\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 433 records after 0 ms and completed after 21 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH x = ()-[*1..1]->()\n",
      "    RETURN x\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'x': [{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Welcome to the Real World',\n",
       "      'title': 'The Matrix',\n",
       "      'released': 1999}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152921504606846977',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Neo']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Welcome to the Real World',\n",
       "       'title': 'The Matrix',\n",
       "       'released': 1999}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Free your mind',\n",
       "      'title': 'The Matrix Reloaded',\n",
       "      'released': 2003}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1155173304420532225',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Neo']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Free your mind',\n",
       "       'title': 'The Matrix Reloaded',\n",
       "       'released': 2003}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "      'title': 'The Matrix Revolutions',\n",
       "      'released': 2003}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157425104234217473',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Neo']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "       'title': 'The Matrix Revolutions',\n",
       "       'released': 2003}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:11',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Evil has its winning ways',\n",
       "      'title': \"The Devil's Advocate\",\n",
       "      'released': 1997}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1159676904047902721',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Kevin Lomax']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:11',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Evil has its winning ways',\n",
       "       'title': \"The Devil's Advocate\",\n",
       "       'released': 1997}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:11'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:87',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever',\n",
       "      'title': 'The Replacements',\n",
       "      'released': 2000}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1161928703861587969',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Shane Falco']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:87',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever',\n",
       "       'title': 'The Replacements',\n",
       "       'released': 2000}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:87'}]}"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# A query to return all relationships where 1 node matches to another node\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH x = ()-[*1..1]->()\n",
    "    RETURN x\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 69 records after 0 ms and completed after 15 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH x = ()-[*4]->()\n",
      "    RETURN x\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'x': [{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Welcome to the Real World',\n",
       "      'title': 'The Matrix',\n",
       "      'released': 1999}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241420',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241479',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157432800815611975',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152922604118474757',\n",
       "     'type': 'DIRECTED',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Welcome to the Real World',\n",
       "       'title': 'The Matrix',\n",
       "       'released': 1999}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:0'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Free your mind',\n",
       "      'title': 'The Matrix Reloaded',\n",
       "      'released': 2003}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241420',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241479',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157432800815611975',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1155174403932160005',\n",
       "     'type': 'DIRECTED',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Free your mind',\n",
       "       'title': 'The Matrix Reloaded',\n",
       "       'released': 2003}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:9'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "      'title': 'The Matrix Revolutions',\n",
       "      'released': 2003}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241420',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241479',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157432800815611975',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157426203745845253',\n",
       "     'type': 'DIRECTED',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Everything that has a beginning has an end',\n",
       "       'title': 'The Matrix Revolutions',\n",
       "       'released': 2003}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:10'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Everything is connected',\n",
       "      'title': 'Cloud Atlas',\n",
       "      'released': 2012}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241420',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241479',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157432800815611975',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1159678003559530501',\n",
       "     'type': 'DIRECTED',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Everything is connected',\n",
       "       'title': 'Cloud Atlas',\n",
       "       'released': 2012}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:119',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Speed has no limits',\n",
       "      'title': 'Speed Racer',\n",
       "      'released': 2008}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:12',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1975, 'name': 'Charlize Theron'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241420',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152929201188241479',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1157432800815611975',\n",
       "     'type': 'FRIENDS_WITH',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:5',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1967, 'name': 'Andy Wachowski'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1161929803373215749',\n",
       "     'type': 'DIRECTED',\n",
       "     'properties': {},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:119',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Speed has no limits',\n",
       "       'title': 'Speed Racer',\n",
       "       'released': 2008}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:119'}]}"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# A query to return nodes that have four relationships deep\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH x = ()-[*4]->()\n",
    "    RETURN x\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 13 records after 1 ms and completed after 4 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH (p:Person {name:\"Tom Hanks\"})-[*0..1]->(m:Movie)\n",
      "    RETURN *\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'p': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "   'labels': frozenset({'Person'}),\n",
       "   'properties': {'born': 1956, 'name': 'Tom Hanks'}}],\n",
       " 'm': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:67',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'At odds in life... in love on-line.',\n",
       "    'title': \"You've Got Mail\",\n",
       "    'released': 1998}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:73',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?',\n",
       "    'title': 'Sleepless in Seattle',\n",
       "    'released': 1993}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:78',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'A story of love, lava and burning desire.',\n",
       "    'title': 'Joe Versus the Volcano',\n",
       "    'released': 1990}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:85',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
       "    'title': 'That Thing You Do',\n",
       "    'released': 1996}},\n",
       "  {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "   'labels': frozenset({'Movie'}),\n",
       "   'properties': {'tagline': 'Everything is connected',\n",
       "    'title': 'Cloud Atlas',\n",
       "    'released': 2012}}]}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Write a query to show zero length paths\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH (p:Person {name:\"Tom Hanks\"})-[*0..1]->(m:Movie)\n",
    "    RETURN *\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started streaming 2 records after 1 ms and completed after 9 ms.\n",
      "\n",
      "Query executed against database: 'neo4j':  \n",
      "    MATCH \n",
      "        (jessica:Person {name:\"Jessica Thompson\"}), \n",
      "        (tom:Person {name: \"Tom Hanks\"}),\n",
      "        shortestPath = allShortestPaths((jessica)-[*]-(tom))\n",
      "    RETURN shortestPath\n",
      "    \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'shortestPath': [{'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'name': 'Jessica Thompson'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Everything is connected',\n",
       "      'title': 'Cloud Atlas',\n",
       "      'released': 2012}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'name': 'Jessica Thompson'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1152927002164986023',\n",
       "     'type': 'REVIEWED',\n",
       "     'properties': {'summary': 'An amazing journey', 'rating': 95},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Everything is connected',\n",
       "       'title': 'Cloud Atlas',\n",
       "       'released': 2012}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1161928703861588039',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Zachry',\n",
       "       'Dr. Henry Goose',\n",
       "       'Isaac Sachs',\n",
       "       'Dermot Hoggins']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:105',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Everything is connected',\n",
       "       'title': 'Cloud Atlas',\n",
       "       'released': 2012}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71'},\n",
       "  {'startNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "   'nodes': [{'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'name': 'Jessica Thompson'}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:109',\n",
       "     'labels': frozenset({'Movie'}),\n",
       "     'properties': {'tagline': 'Break The Codes',\n",
       "      'title': 'The Da Vinci Code',\n",
       "      'released': 2006}},\n",
       "    {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "     'labels': frozenset({'Person'}),\n",
       "     'properties': {'born': 1956, 'name': 'Tom Hanks'}}],\n",
       "   'relationships': [{'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:167',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'name': 'Jessica Thompson'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1161934201419727015',\n",
       "     'type': 'REVIEWED',\n",
       "     'properties': {'summary': 'A solid romp', 'rating': 68},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:109',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Break The Codes',\n",
       "       'title': 'The Da Vinci Code',\n",
       "       'released': 2006}}},\n",
       "    {'startNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71',\n",
       "      'labels': frozenset({'Person'}),\n",
       "      'properties': {'born': 1956, 'name': 'Tom Hanks'}},\n",
       "     'elementId': '5:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:1164180503675273287',\n",
       "     'type': 'ACTED_IN',\n",
       "     'properties': {'roles': ['Dr. Robert Langdon']},\n",
       "     'endNode': {'elementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:109',\n",
       "      'labels': frozenset({'Movie'}),\n",
       "      'properties': {'tagline': 'Break The Codes',\n",
       "       'title': 'The Da Vinci Code',\n",
       "       'released': 2006}}}],\n",
       "   'endNodeElementId': '4:552b0252-2f83-4c7e-a0bf-f921a4b1b7cf:71'}]}"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# You can find the shortest path between two nodes by matching two and then using the 'allShortestPath' function\n",
    "result = driver.execute_query(\n",
    "    \"\"\" \n",
    "    MATCH \n",
    "        (jessica:Person {name:\"Jessica Thompson\"}), \n",
    "        (tom:Person {name: \"Tom Hanks\"}),\n",
    "        shortestPath = allShortestPaths((jessica)-[*]-(tom))\n",
    "    RETURN shortestPath\n",
    "    \"\"\", \n",
    "    database_=\"neo4j\"\n",
    ")\n",
    "\n",
    "data = Neo4jParser.parse(result, True, False)\n",
    "# For each key returned, show the top 5 records\n",
    "head = {}\n",
    "for key in data.keys():\n",
    "    head[key] = data[key][:5]\n",
    "\n",
    "# This is a good example to run in Neo4j desktop to better visualize the results. But there are two equally shortest paths.\n",
    "head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "udemy_neo4j_course",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
